//
//  PaiTable.swift
//  MbMajiang
//
//  Created by Ryu Nakamura on 2026/04/04.
//

import Foundation

let paiTable: [String: String] = [
    "_":"_",
    
    "p0": "赤ウーピン",
    "p1": "イーピン",
    "p2": "リャンピン",
    "p3": "サンピン",
    "p4": "スーピン",
    "p5": "ウーポン",
    "p6": "ローピン",
    "p7": "チーピン",
    "p8": "パーピン",
    "p9": "キューピン",
    
    "m0": "赤ウーマン",
    "m1": "イーマン",
    "m2": "リャンマン",
    "m3": "サンマン",
    "m4": "スーマン",
    "m5": "ウーマン",
    "m6": "ローマン",
    "m7": "チーマン",
    "m8": "パーマン",
    "m9": "キューマン",
    
    "s0": "赤ウーソー",
    "s1": "イーソー",
    "s2": "リャンソー",
    "s3": "サンソー",
    "s4": "スーソー",
    "s5": "ウーソー",
    "s6": "ローソー",
    "s7": "チーソー",
    "s8": "パーソー",
    "s9": "キューソー",
    
    "z1": "トン",
    "z2": "ナン",
    "z3": "シャー",
    "z4": "ペー",
    "z5": "ハク",
    "z6": "ハツ",
    "z7": "チュン",
]

let baopaiTable: [String: [String]] = [
    "p0": ["p6"],
    "p1": ["p2"],
    "p2": ["p3"],
    "p3": ["p4"],
    "p4": ["p5","p0"],
    "p5": ["p6"],
    "p6": ["p7"],
    "p7": ["p8"],
    "p8": ["p9"],
    "p9": ["p1"],
    
    "m0": ["m6"],
    "m1": ["m2"],
    "m2": ["m3"],
    "m3": ["m4"],
    "m4": ["m5","m0"],
    "m5": ["m6"],
    "m6": ["m7"],
    "m7": ["m8"],
    "m8": ["m9"],
    "m9": ["m1"],
    
    "s0": ["s6"],
    "s1": ["s2"],
    "s2": ["s3"],
    "s3": ["s4"],
    "s4": ["s5","s0"],
    "s5": ["s6"],
    "s6": ["s7"],
    "s7": ["s8"],
    "s8": ["s9"],
    "s9": ["s1"],
    
    "z1": ["z2"],
    "z2": ["z3"],
    "z3": ["z4"],
    "z4": ["z1"],
    "z5": ["z6"],
    "z6": ["z7"],
    "z7": ["z5"],
]
